--create table breeds (
--BreedName varchar(80) CONSTRAINT pd_BreedName PRIMARY KEY,
--BreedGroup varchar(80) NOT NULL
--);


insert into breeds (breedname, breedgroup) values 
('Фокстерьер', 'Терьеры'),
('Бордер терьер', 'Терьеры'),
('Вельш терьер', 'Терьеры'),
('Эрдель терьер', 'Терьеры'),
('Бразильский терьер', 'Терьеры'),
('Бладхаунд', 'Гончие'),
('Английский фоксхаунд', 'Гончие'),
('Оттерхаунд', 'Гончие'),
('Пойтевин', 'Гончие'),
('Харьер', 'Гончие'),
('Финская гончая', 'Гончие'),
('Русская гончая', 'Гончие'),
('Золотистый ретривер', 'Ретриверы'),
('Лабрадор ретривер', 'Ретриверы'),
('Новошотландский ретривер', 'Ретриверы');