INSERT INTO Customer (FName, Lname, IdCity, Address,  Zip, Phone) values
('Соловьёва', 'Анастасия', 2, 'Кул Гали, 2', '11112', '890032892'),
('Терсинцева', 'Настасья', 3, 'Кул Гали, 3', '11113', '890032893'),
('Мигачёва', 'Варвара', 4, 'Кул Гали, 4', '11114', '890032894'),
('Пастухова', 'Карина', 5, 'Кул Гали, 5', '11115', '890032895'),
('Андронов', 'Арсений', 6, 'Кул Гали, 6', '11116', '890032896'),
('Митрофанов', 'Стас', 7, 'Кул Гали, 7', '11117', '890032897'),
('Путин', 'Михаил', 8, 'Кул Гали, 8', '11118', '890032898'),
('Пригожин', 'Ваня', 9, 'Кул Гали, 9', '11119', '890032899');

SELECT TOP (1000) [IdCust]
      ,[FName]
      ,[LName]
      ,[IdCity]
      ,[Address]
      ,[Zip]
      ,[Phone]
  FROM [Sales].[dbo].[Customer]
