kgeu = {'ПМ-1-22': {'Гусманов Альгиз Радикович': {'address': 'г. Казань',
                                                  'phone': '+7-777-777-77-77',
                                                  'tabel': {'Алгоритмизация': [5, 4, 5, 4],
                                                            'Информатика': [5, 5, 5, 5],
                                                            'Физкультура': [4, 3, 4, 4]}
                                                  },
                    'Мударисов Данил Русланович': {'address': 'г. Казань',
                                                   'phone': '+7-777-777-77-77',
                                                   'tabel': {'Алгоритмизация': [4, 4, 5, 4],
                                                             'Информатика': [5, 5, 3, 5],
                                                             'Физкультура': [3, 5, 3, 4]}
                                                   }

                    },
        'ПМ-2-22': {'Габриелова Елизавета Сергеевна': {'address': 'г. Казань',
                                                       'phone': '+7-777-777-77-77',
                                                       'tabel': {'Алгоритмизация': [5, 5, 5, 5],
                                                                 'Информатика': [5, 5, 5, 5],
                                                                 'Физкультура': [5, 5, 5, 5]}
                                                       },
                    'Бебко Анатолий Евгеньевич': {'address': 'г. Казань',
                                                  'phone': '+7-777-777-77-77',
                                                  'tabel': {'Алгоритмизация': [5, 4, 4, 4],
                                                            'Информатика': [5, 3, 4, 3],
                                                            'Физкультура': [5, 5, 5, 5]}
                                                  }
                    }
        }

print('    Ответ:')
for i in kgeu.keys():
    group = kgeu[i]
    print(11 * ' ' + 'Группа ' + i)
    c = len(group.keys())  # количество человек
    print(11 * ' ' + 'Количество человек в группе:', c)
    d = {'Алгоритмизация': [], 'Информатика': [], 'Физкультура': []}
    for k in group.keys():
        print(11 * ' ' + k + ':')
        print(*[24 * ' ' + i[0] + ': ' + ', '.join(map(str, i[1])) for i in group[k]['tabel'].items()], sep='\n')
        print(24 * ' ' + 'Средняя успеваемость: ')
        print(*[34 * ' ' + i[0] + ': ' + str(sum(i[1]) / len(i[1])) for i in group[k]['tabel'].items()], sep='\n')
        for l in group[k]['tabel'].items():
            d[l[0]].append(sum(l[1]) / 4)
    print(11 * ' ' + "Средняя успеваемость группы", i, "\b:")
    for j in d.keys():
        print(23 * ' ', j + ':', sum(d[j]) / c)
    print()
